# Вычислить число Пи c заданной точностью d
# Пример:
# при $d = 0.001, π = 3.141.$ $10^{-1} ≤ d ≤10^{-10}$

import math


# вариант 1
d = int(input('Введите точность - число знаков после запятой: '))
print(round(math.pi, d))

# вариант 2 (после 7 тормозит)
n, s1, s2 = 2, 0, 0
s1 = s2 + 4/(2*1 -1)
s2 = s1 - 4/(2*2 -1)
while s1 - s2 >= 10**-d:
    n += 1
    s1 = s2 + 4/(2*n -1)
#    print(s1)
    n += 1
    s2 = s1 - 4/(2*n -1)
    #print(s1 - s2)
print(round((s1 + s2)/2, d))